Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh11-v3.tmx
Source language: bo
Languages: en

source: རྗེས་སུ་དྲན་པར་ལྟ་བ་དང་། འདུ་ཤེས་ཀྱི་རྣམ་པར་ལྟ་བ་དང་། ཤེས་པར་ལྟ་བ་དང་། ཏིང་ངེ་འཛིན་དུ་ལྟ་བ་དང་། དབང་པོར་ལྟ་བ་དང་། ཟིལ་གྱིས་གནོན་པའི་སྐྱེ་མཆེད་དུ་ལྟ་བ་དང་། ཟད་པར་གྱི་སྐྱེ་མཆེད་དུ་ལྟ་བ་དང་། སྟོང་པ་ཉིད་དུ་ལྟ་བ་དང་།
en: Similarly, there is a view concerning the contemplations [of impurity], a view concerning the recollections, a view concerning the aspects of perception, a view concerning the modes of knowledge, a view concerning the meditative stabilities, a view concerning the faculties, a view concerning the sense fields of mastery, and a view concerning the aspects of emptiness.

source: དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་དང་། ཐམས་ཅད་ཤེས་པ་ཉིད་དང་། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དུ་ལྟ་བ་དང་།
en: Similarly, there are views concerning the ten powers of a tathāgata, the assurances, the kinds of exact knowledge, great loving kindness, great compassion, the eighteen distinct qualities of the buddhas, the understanding of all phenomena, the understanding of the aspects of the path, [and omniscience].

source: དེ་བཞིན་དུ་ཕ་རོལ་ཏུ་ཕྱིན་པར་ལྟ་བ་དང་། མངོན་པར་ཤེས་པར་ལྟ་བ་དང་། མིང་དུ་ལྟ་བ་དང་།
en: Similarly, there is a view concerning the transcendent perfections, a view concerning the extrasensory powers, a view concerning the eyes, a view concerning the major marks, and a view concerning the minor marks.

source: མཚན་དུ་ལྟ་བ་དང་། དཔེ་བྱད་བཟང་པོར་ལྟ་བ་སྟེ། ཤ་ར་དྭ་ཏིའི་བུ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཆོས་ཐམས་ཅད་ལ་ལྟ་བ་ཡོངས་སུ་འཛིན་པ་ཡིན་ནོ། །
en: Śāradvatī­putra, these are the views that great bodhisattva beings might adopt, with respect to all things.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཆོས་ཐམས་ཅད་ལ་སེམས་རྣམ་པར་རྨོངས་པ་གང་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕུང་པོ་ལྔ་ནས་རྒ་ཤིའི་བར་དུ་དེ་བཞིན་དུ་སྦྱར་བ་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ནས་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་དུ་དེ་བཞིན་དུ་སྦྱར་བ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་ནས། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་དེ་བཞིན་དུ་སྦྱར་བ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ནས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་དེ་བཞིན་དུ་སྦྱར་བ་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ།
en: Then he asked, “Lord, what are the deluded mindsets that great bodhisattva beings might have with respect to all things?”

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དང་། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུའི་བར་དག་རྟག་པའམ་མི་རྟག་པའམ། བདེ་བའམ་སྡུག་བསྔལ་བའམ། བདག་ཡོད་པའམ་བདག་མེད་པའམ། སྟོང་པའམ་མི་སྟོང་པའམ། མཚན་མ་ཡོད་པའམ། མཚན་མ་མེད་པའམ། སྨོན་པ་ཡོད་པ་ཡོད་པའམ། སྨོན་པ་མེད་པའམ། ཞི་བའམ་མ་ཞི་བའམ། དབེན་པའམ་མི་དབེན་པའམ། ཀུན་ནས་ཉོན་མོངས་པའམ། རྣམ་པར་བྱང་བའམ། སྐྱེ་བའམ་མི་སྐྱེ་བའམ། འགག་པའམ་མི་འགག་པའམ། དངོས་པོའམ་དངོས་པོ་མེད་པར་ལྟ་ཞིང་དམིགས་ལ་འཛིན་ཅིང་མཚན་མར་བྱེད་པ་དང་། རྟོག་པ་དང་ཡོངས་སུ་དཔྱོད་པར་བྱེད་པ་སྟེ། དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཆོས་ཐམས་ཅད་ལ་སེམས་རྣམ་པར་རྨོངས་པ་ཞེས་བྱའོ། །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་སྙམ་དུ་འདི་དག་ནི་དགེ་བའི་ཆོས་རྣམས་སོ། །འདི་དག་ནི་མི་དགེ་བའི་ཆོས་རྣམས་སོ། །འདི་དག་ནི་ལུང་དུ་བསྟན་པའི་ཆོས་རྣམས་སོ། །འདི་དག་ནི་ལུང་དུ་མ་བསྟན་པའི་ཆོས་རྣམས་སོ། །འདི་དག་ནི་འཇིག་རྟེན་པའི་ཆོས་རྣམས་སོ། །འདི་དག་ནི་འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་རྣམས་སོ། །འདི་དག་ནི་ཟག་པ་དང་བཅས་པའི་ཆོས་རྣམས་སོ། །འདི་དག་ནི་ཟག་པ་མེད་པའི་ཆོས་རྣམས་སོ། །འདི་དག་ནི་འདུས་བྱས་ཀྱི་ཆོས་རྣམས་སོ། །
en: The Blessed One replied, “Śāradvatī­putra, with regard to [those phenomena] that commence from the five psycho-physical aggregates and extend as far as the link [of dependent origination known as] aging and death, and likewise with regard to those commencing from the four applications of mindfulness and extending as far as the noble eightfold path, and likewise with regard to those commencing from the three gateways to liberation and extending as far as the emptiness of the essential nature of non-entities, and likewise with regard to those commencing from the ten powers of the tathāgatas and extending as far as omniscience, and likewise with regard to those commencing from the six transcendent perfections and extending as far as the eighty minor marks—when one views them as permanent or impermanent, as conducive to happiness or suffering, as a self or not a self, empty or not empty, with signs or signless, having aspirations or without aspirations, calm or not calm, void or not void, afflicted or purified, arising or not arising, ceasing or not ceasing, and as entities or non-entities, and when one apprehends, defines, and engages in ideation and scrutiny with respect to them, that is called the deluded mind which great bodhisattva beings might have with respect to all things.

source: འདི་དག་ནི་འདུས་མ་བྱས་ཀྱི་ཆོས་རྣམས་སོ། །འདི་དག་ནི་ཐུན་མོང་གི་ཆོས་རྣམས་སོ། །འདི་དག་ནི་ཐུན་མོང་མ་ཡིན་པའི་ཆོས་རྣམས་སོ་ཞེས་བྱ་བར་ལྟ་ཞིང་དམིགས་ལ་འཛིན་ཅིང་མཚན་མར་བྱེད་པ་དང་། རྟོག་པ་དང་ཡོངས་སུ་དཔྱོད་པར་བྱེད་ན། ཤ་ར་དྭ་ཏིའི་བུ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཆོས་ཐམས་ཅད་ལ་སེམས་རྣམ་པར་རྨོངས་པ་ཞེས་བྱའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “Moreover, Śāradvatī­putra, whenever a great bodhisattva being holds the view that these are virtuous phenomena, these are non-virtuous phenomena, these are specific phenomena, these are non-specific phenomena, these are mundane phenomena, these are supramundane phenomena, these are contaminated phenomena, these are uncontaminated phenomena, these are conditioned phenomena, these are unconditioned phenomena, these are common phenomena, or these are uncommon phenomena, and then apprehends, defines, and engages in ideation and scrutiny with respect to them, that, Śāradvatī­putra, is called the deluded mind which great bodhisattva beings might have with respect to all things.

source: སེམས་ཅན་མེད་པའི་ཕྱིར་དང་། སེམས་ཅན་མི་དམིགས་པ་ཉིད་ཀྱི་ཕྱིར་དང་། སེམས་ཅན་སྐྱེ་བ་མེད་པའི་ཕྱིར་དང་། སེམས་ཅན་འགག་པ་མེད་པའི་ཕྱིར་དང་། སེམས་ཅན་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་རོ། །དེ་བཞིན་དུ་སྲོག་དང་། གསོ་བ་དང་། སྐྱེས་བུ་དང་། གང་ཟག་དང་། ཤེད་ལས་སྐྱེས་པ་དང་། ཤེད་བུ་དང་། བྱེད་པ་པོ་དང་། བྱེད་པ་པོ་ཉིད་དང་། སློང་བ་པོ་དང་། ཀུན་ནས་སློང་བ་པོ་དང་། ཚོར་བ་པོ་དང་། ཚོར་བར་བྱེད་པ་པོ་དང་། ཤེས་པ་པོ་དང་།
en: If you ask why, it is because there are no sentient beings, because sentient beings are non-apprehensible, because sentient beings are non-arising, because sentient beings are unceasing, and because sentient beings are in fact emptiness.

source: མཐོང་བ་པོ་མེད་པའི་ཕྱིར་དང་། མི་དམིགས་པའི་ཕྱིར་དང་། སྐྱེ་བ་མེད་པའི་ཕྱིར་དང་། འགག་པ་མེད་པའི་ཕྱིར་དང་། སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་རོ། །
en: The same goes for living organisms, lives, living creatures, individuals, humankind, human beings, actors, creators, petitioners, instigators, experiencers, experiencing subjects, and knowers, because they are not perceived, because they are non-apprehensible, because they are non-arising, because they are unceasing, and because they are in fact emptiness.

source: ཆོས་རྣམས་ཀྱང་སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དང་། སྟོང་པ་དང་། གཡོ་བ་མེད་པ་དང་། གསོ་བ་དང་། ཡ་མ་བརླ་དང་། བདག་པོ་མེད་པ་དང་། བྱུང་བ་མེད་པ་དང་། མ་བྱས་པ་དང་། མངོན་པར་འདུས་མ་བྱས་པ་དང་། བྱེད་པ་པོ་དང་བྲལ་བའོ། །
en: “Indeed, all phenomena are non-arising, unceasing, empty, unmoving, vacuous, without a self, non-originated, uncreated, unconditioned, and without creator or actor.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་གཟུགས་དེ་ནི་འདི་ལྟ་སྟེ། མིང་ཙམ་མོ། །ཚོར་བ་དང་། འདུ་ཤེས་དང་།
en: If you ask why, it is the case that these physical forms are merely names, and the same also goes for feelings, perceptions, formative predispositions, and consciousness.

source: འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ཡང་དེ་བཞིན་ནོ། །རྒ་བ་དང་། འཆི་བའི་བར་དུ་ཡང་དེ་བཞིན་དུ་སྦྱར་རོ། །
en: Indeed, the same applies to [all the remaining phenomenological categories] as far as the [dependent link of aging and death].

source: དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ཞེས་བྱ་བ་འདི་དག་ནི་འདི་ལྟ་སྟེ། མིང་ཙམ་མོ། །འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་དུ་ཡང་དེ་བཞིན་དུ་སྦྱར་རོ། །
en: “Similarly, these four applications of mindfulness are merely names, and the same applies to [all the remaining causal attributes] up to and including the noble eightfold path.

source: རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་པོ་འདི་དག་ནི་འདི་ལྟ་སྟེ་མིང་ཙམ་མོ། །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་ཡང་དེ་བཞིན་དུ་སྦྱར་རོ། །
en: These three gateways to liberation are merely names, and the same applies to [all the remaining meditative experiences], up to and including the emptiness of the essential nature of non-entities.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་པོ་འདི་དག་ནི་འདི་ལྟ་སྟེ། མིང་ཙམ་མོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཡང་དེ་བཞིན་དུ་སྦྱར་རོ། །
en: These ten powers of the tathāgatas are merely names, and the same applies to [all the remaining fruitional attributes and attainments], up to and including omniscience.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་འདི་དག་ནི་འདི་ལྟ་སྟེ། མིང་ཙམ་མོ། །དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུའི་བར་དུ་ཡང་དེ་བཞིན་དུ་སྦྱར་རོ། །
en: These six transcendent perfections are merely names, and the same applies to [all the remaining fruitional attributes], up to and including the eighty minor marks.

source: ཤ་ར་དྭ་ཏིའི་བུ་མིང་ཙམ་པོ་གང་དག་ཡིན་པ་དེ་དེ་ལ་ཡང་དག་པར་ཡོངས་སུ་གྲུབ་པ་འགའ་ཞིག་ཡོད་དམ།
en: “Śāradvatī­putra! With regard to those things, which are merely names, are there any that are absolutely existent?”

source: གསོལ་པ་བཙུན་པ་བཅོམ་ལྡན་འདས་མ་མཆིས་ལགས་སོ། །
en: “There are none, Lord!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: he replied.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས།
en: “Śāradvatī­putra!”

source: གལ་ཏེ་ཡོངས་སུ་གྲུབ་པར་ལྟ་ཞིང་དམིགས་ལ་འཛིན་ཅིང་མཚན་མར་བྱེད། རྟོག་པ་དང་དཔྱོད་པར་བྱེད་ན། དེ་ལྟ་བ་ཡོངས་སུ་འཛིན་པ་དང་། སེམས་རྣམ་པར་རྨོངས་པ་ཡིན་ནམ་གསོལ་པ།
en: said the Blessed One, “If one were to view these as absolutely existent, and apprehend them [dualistically], define them, and engage in ideation and scrutiny with respect to them, do you think that this would not be tantamount to the [aforementioned] views that bodhisattvas might adopt, and to the deluded minds which they might have?”

source: བཅོམ་ལྡན་འདས་དེ་ལྟ་ལགས་སོ། །
en: “Yes it would, Lord!” he replied.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་དེས་ན།
en: Then the Blessed One said, “Śāradvatī­putra!

source: འདི་ལྟར་ལྟ་བ་ཡོངས་སུ་འཛིན་པ་དང་། སེམས་རྣམ་པར་རྨོངས་པ་གཉིས་ནི་འདི་ལྟ་སྟེ། མངོན་པར་ཞེན་པ་ཞེས་བྱ་བ་འདིའི་ཚིག་བླ་དགས་ཡིན་པར་རིག་པར་བྱའོ། །
en: For these reasons you should understand that the views bodhisattvas might adopt and the deluded minds which they might have are both designated as ‘fixation’.”

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་རྣམ་གྲངས་གང་གིས་ན་ཕུང་པོ་ལྔ་ནས་དེ་བཞིན་དུ་སྦྱར་ཏེ། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུའི་བར་དུ་མིང་ཙམ་དུ་བས་པ་ལགས་སམ།
en: Thereupon, the venerable Śāradvatī­putra asked the Blessed One as follows: “Reverend Lord, how are all these things, commencing from the five psycho-physical aggregates and extending as far as the eighty minor marks, reduced, in the end, to mere names?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། ཕུང་པོ་ལྔ་ཞེས་བྱ་བ་གང་དག་ཡིན་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ། ཆོས་སུ་བཏགས་པ་ཙམ་དུ་ཟད་དོ། །
en: The Blessed One replied, “Śāradvatī­putra, the ‘five psycho-physical aggregates’ are merely conceptualized.

source: ཆོས་སུ་བཏགས་པ་དེ་ལ་ནི་སྐྱེ་བ་མེད། འགག་པ་མེད་དེ། མིང་གི་བརྡས་ཐ་སྙད་དུ་འདོགས་པ་ཁོ་ནར་ཟད་ལ།
en: Anything that is conceptualized is subject neither to arising, nor to cessation, and only conventionally designated by names and symbols.

source: ཕུང་པོའི་མིང་དེ་དག་ཀྱང་ནང་ན་ཡང་མེད་ཕྱི་རོལ་ན་ཡང་མེད། གཉི་གའི་བར་ན་ཡང་མི་གནས་སོ། །
en: Even the names of the psycho-physical aggregates do not exist internally, nor do they exist externally, and nor do they abide between these two.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། ནང་གི་སྐྱེ་མཆེད་དྲུག་ཅེས་བྱ་བ་གང་དག་ཡིན་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ། ཆོས་སུ་བཏགས་པ་ཙམ་དུ་ཟད་དོ། །
en: “Śāradvatī­putra, the ‘six inner sense fields’ are, in the end, merely conceptualized.

source: ཆོས་སུ་བཏགས་པ་དེ་ལ་ནི་སྐྱེ་བ་མེད།
en: Anything that is conceptualized neither arises nor ceases, and is only conventionally designated by names and symbols.

source: འགག་པ་མེད་དེ་མིང་གི་བརྡས་ཐ་སྙད་དུ་འདོགས་པ་ཁོ་ནར་ཟད་ལ་ནང་གི་སྐྱེ་མཆེད་དྲུག་གི་མིང་དེ་དག་ཀྱང་ནང་ན་ཡང་མེད། ཕྱི་རོལ་ན་ཡང་མེད། གཉི་གའི་བར་ན་ཡང་མི་གནས་སོ། །
en: Even the names of the six inner sense fields do not exist internally, nor do they exist externally, and nor do they abide between these two.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། ཕྱིའི་སྐྱེ་མཆེད་དྲུག་ཅེས་བྱ་བ་གང་དག་ཡིན་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ། ཆོས་སུ་བཏགས་པ་ཙམ་དུ་ཟད་དོ། །
en: “Śāradvatī­putra, the ‘six outer sense fields’ are merely conceptualized.

source: ཕྱིའི་སྐྱེ་མཆེད་དྲུག་གི་མིང་དེ་དག་ཀྱང་ནང་ན་ཡང་མེད། ཕྱི་རོལ་ན་ཡང་མེད། གཉི་གའི་བར་ན་ཡང་མི་གནས་སོ། །
en: Even the names of the six outer sense fields do not exist internally, nor do they exist externally, and nor do they abide between these two.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། ཁམས་བཅྭ་བརྒྱད་ཅེས་བྱ་བ་གང་དག་ཡིན་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ། ཆོས་སུ་བཏགས་པ་ཙམ་དུ་ཟད་དོ། །
en: “Śāradvatī­putra, the ‘eighteen sensory elements’ are merely conceptualized.

source: ཁམས་ཀྱི་མིང་དེ་དག་ཀྱང་ནང་ན་ཡང་མེད། ཕྱི་རོལ་ན་ཡང་མེད། གཉིས་ཀའི་བར་ན་ཡང་མི་གནས་སོ། །
en: Even the names of the sensory elements do not exist internally, nor do they exist externally, and nor do they abide between these two.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། འཕགས་པའི་བདེན་པ་བཞི་ཞེས་བྱ་བ་གང་དག་ཡིན་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ། ཆོས་སུ་བཏགས་པ་ཙམ་དུ་ཟད་དོ། །
en: “Śāradvatī­putra, the ‘four noble truths’ are merely conceptualized.

source: ཆོས་སུ་བཏགས་པ་དེ་ལ་ནི་སྐྱེ་བ་མེད་འགག་པ་མེད་དེ། མིང་གི་བརྡས་ཐ་སྙད་དུ་འདོགས་པ་ཁོ་ནར་ཟད་ལ།
en: Anything that is conceptualized neither arises nor ceases, and is only conventionally designated by names and symbols.

source: འཕགས་པའི་བདེན་པའི་མིང་དེ་དག་ཀྱང་ནང་ན་ཡང་མེད་ཕྱི་རོལ་ན་ཡང་མེད། གཉི་གའི་བར་ན་ཡང་མི་གནས་སོ། །
en: Even the names of the noble truths do not exist internally, nor do they exist externally, and nor do they abide between these two.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཡན་ལག་བཅུ་གཉིས་པ་ཞེས་བྱ་བ་གང་དག་ཡིན་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ། ཆོས་སུ་བཏགས་པ་ཙམ་དུ་ཟད་དོ། །
en: “Śāradvatī­putra, the ‘twelve links of dependent origination’ are merely conceptualized.

source: རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་མིང་དེ་ཡང་ནང་ན་ཡང་མེད་ཕྱི་རོལ་ན་ཡང་མེད། གཉི་གའི་བར་ན་ཡང་མི་གནས་སོ། །
en: Even the names of the links of dependent origination do not exist internally, nor do they exist externally, and nor do they abide between these two.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ཞེས་བྱ་བ་གང་དག་ཡིན་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ། ཆོས་སུ་བཏགས་པ་ཙམ་དུ་ཟད་དོ། །
en: “Śāradvatī­putra, the ‘four applications of mindfulness’ are merely conceptualized.

source: དྲན་པ་ཉེ་བར་གཞག་པའི་མིང་དེ་དག་ཀྱང་ནང་ན་ཡང་མེད། ཕྱི་རོལ་ན་ཡང་མེད། གཉི་གའི་བར་ན་ཡང་མི་གནས་སོ། །
en: Even the names of the applications of mindfulness do not exist internally, nor do they exist externally, and nor do they abide between these two.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། ཡང་དག་པའི་སྤོང་བ་བཞི་ཞེས་བྱ་བ་གང་དག་ཡིན་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ། ཆོས་སུ་བཏགས་པ་ཙམ་དུ་ཟད་དོ། །
en: “Śāradvatī­putra, the ‘four correct exertions’ are merely conceptualized.

source: ཆོས་སུ་བཏགས་པ་དེ་ལ་ནི་སྐྱེ་བ་མེད་འགག་པ་མེད་དེ།མིང་གི་བརྡས་ཐ་སྙད་དུ་འདོགས་པ་ཁོ་ནར་ཟད་ལ།
en: Anything that is conceptualized neither arises nor ceases, and is only conventionally designated by names and symbols.

source: ཡང་དག་པའི་སྤོང་བའི་མིང་དེ་དག་ཀྱང་ནང་ན་ཡང་མེད་ཕྱི་རོལ་ན་ཡང་མེད། གཉི་གའི་བར་ན་ཡང་མི་གནས་སོ། །
en: Even the names of the correct exertions do not exist internally, nor do they exist externally, and nor do they abide between these two.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་ཞེས་བྱ་བ་གང་དག་ཡིན་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ། ཆོས་སུ་བཏགས་པ་ཙམ་དུ་ཟད་དོ། །
en: “Śāradvatī­putra, the ‘four supports for miraculous ability’ are merely conceptualized.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པའི་མིང་དེ་དག་ཀྱང་ནང་ན་ཡང་མེད། ཕྱི་རོལ་ན་ཡང་མེད། གཉི་གའི་བར་ན་ཡང་མི་གནས་སོ། །
en: Even the names of the supports for miraculous ability do not exist internally, nor do they exist externally, and nor do they abide between these two.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། དབང་པོ་ལྔ་ཞེས་བྱ་བ་གང་དག་ཡིན་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ། ཆོས་སུ་བཏགས་པ་ཙམ་དུ་ཟད་དོ། །
en: “Śāradvatī­putra, the ‘five faculties’ are merely conceptualized.

source: དབང་པོ་ལྔའི་མིང་དེ་དག་ཀྱང་ནང་ན་ཡང་མེད་ཕྱི་རོལ་ན་ཡང་མེད། གཉི་གའི་བར་ན་ཡང་མི་གནས་སོ། །
en: Even the names of the five faculties do not exist internally, nor do they exist externally, and nor do they abide between these two.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། སྟོབས་ལྔ་ཞེས་བྱ་བ་གང་དག་ཡིན་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ། ཆོས་སུ་བཏགས་པ་ཙམ་དུ་ཟད་དོ། །
en: “Śāradvatī­putra, the ‘five powers’ are merely conceptualized.

source: སྟོབས་ཀྱི་མིང་དེ་དག་ཀྱང་ནང་ན་ཡང་མེད་ཕྱི་རོལ་ན་ཡང་མེད། གཉི་གའི་བར་ན་ཡང་མི་གནས་སོ། །
en: Even the names of the five powers do not exist internally, nor do they exist externally, and nor do they abide between these two.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་ཞེས་བྱ་བ་གང་དག་ཡིན་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ། ཆོས་སུ་བཏགས་པ་ཙམ་དུ་ཟད་དོ། །
en: “Śāradvatī­putra, the ‘seven branches of enlightenment’ are merely conceptualized.

source: བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་མིང་དེ་དག་ཀྱང་ནང་ན་ཡང་མེད་ཕྱི་རོལ་ན་ཡང་མེད། གཉི་གའི་བར་ན་ཡང་མི་གནས་སོ། །
en: Even the names of the branches of enlightenment do not exist internally, nor do they exist externally, and nor do they abide between these two.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཞེས་བྱ་བ་གང་དག་ཡིན་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ། ཆོས་སུ་བཏགས་པ་ཙམ་དུ་ཟད་དོ། །
en: “Śāradvatī­putra, the ‘noble eightfold path’ is merely conceptualized.

source: འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་མིང་དེ་ཡང་ནང་ན་ཡང་མེད་ཕྱི་རོལ་ན་ཡང་མེད། གཉི་གའི་བར་ན་ཡང་མི་གནས་སོ། །
en: Even the name of the noble eightfold path does not exist internally, nor does it exist externally, and nor does it abide between these two.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་ཞེས་བྱ་བ་གང་དག་ཡིན་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ། ཆོས་སུ་བཏགས་པ་ཙམ་དུ་ཟད་དོ། །
en: “Śāradvatī­putra, the ‘three gateways to liberation’ are merely conceptualized.

source: རྣམ་པར་ཐར་པའི་མིང་དེ་དག་ཀྱང་ནང་ན་ཡང་མེད་ཕྱི་རོལ་ན་ཡང་མེད། གཉི་གའི་བར་ན་ཡང་མི་གནས་སོ། །
en: Even the names of the gateways to liberation do not exist internally, nor do they exist externally, and nor do they abide between these two.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། བསམ་གཏན་བཞི་ཞེས་བྱ་བ་གང་དག་ཡིན་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ། ཆོས་སུ་བཏགས་པ་ཙམ་དུ་ཟད་དོ།
en: “Śāradvatī­putra, the ‘four meditative concentrations’ are merely conceptualized.

source: བསམ་གཏན་གྱི་མིང་དེ་དག་ཀྱང་ནང་ན་ཡང་མེད་ཕྱི་རོལ་ན་ཡང་མེད། གཉི་གའི་བར་ན་ཡང་མི་གནས་སོ། །
en: Even the names of the meditative concentrations do not exist internally, nor do they exist externally, and nor do they abide between these two.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། ཚད་མེད་པ་བཞི་ཞེས་བྱ་བ་གང་དག་ཡིན་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ། ཆོས་སུ་བཏགས་པ་ཙམ་དུ་ཟད་དོ། །
en: “Śāradvatī­putra, the ‘four immeasurable aspirations’ are merely conceptualized.

source: ཚད་མེད་པའི་མིང་དེ་དག་ཀྱང་ནང་ན་ཡང་མེད། ཕྱི་རོལ་ན་ཡང་མེད། གཉི་གའི་བར་ན་ཡང་མི་གནས་སོ། །
en: Even the names of the immeasurable aspirations do not exist internally, nor do they exist externally, and nor do they abide between these two.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་ཞེས་བྱ་བ་གང་དག་ཡིན་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ། ཆོས་སུ་བཏགས་པ་ཙམ་དུ་ཟད་དོ། །
en: “Śāradvatī­putra, the ‘four formless meditative absorptions’ are merely conceptualized.

source: ཆོས་སུ་བཏགས་པ་དེ་ལ་ནི་སྐྱེ་བ་མེད་འགག་པ་མེད་དེ། མིང་གི་བརྡས་ཐ་སྙད་དུ་འདོགས་པ་ཁོ་ནར་ཟད་དོ། །
en: Anything that is conceptualized neither arises nor ceases, and is only conventionally designated by names and symbols.

source: གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པའི་མིང་དེ་དག་ཀྱང་ནང་ན་ཡང་མེད་ཕྱི་རོལ་ན་ཡང་མེད། གཉི་གའི་བར་ན་ཡང་མི་གནས་སོ། །
en: Even the names of the formless meditative absorptions do not exist internally, nor do they exist externally, and nor do they abide between these two.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། རྣམ་པར་ཐར་པ་བརྒྱད་ཅེས་བྱ་བ་གང་དག་ཡིན་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ། ཆོས་སུ་བཏགས་པ་ཙམ་དུ་ཟད་དོ། །
en: “Śāradvatī­putra, the ‘eight aspects of liberation’ are merely conceptualized.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་ཞེས་བྱ་བ་གང་དག་ཡིན་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ། ཆོས་སུ་བཏགས་པ་ཙམ་དུ་ཟད་དོ། །
en: “Śāradvatī­putra, the ‘nine serial steps of meditative absorption’ are merely conceptualized.

source: མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པའི་མིང་དེ་དག་ཀྱང་ནང་ན་ཡང་མེད་ཕྱི་རོལ་ན་ཡང་མེད། གཉི་གའི་བར་ན་ཡང་མི་གནས་མོ། །
en: Even the names of the serial steps of meditative absorption do not exist internally, nor do they exist externally, and nor do they abide between these two.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། འདུ་ཤེས་དགུ་ཞེས་བྱ་བ་གང་དག་ཡིན་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ། ཆོས་སུ་བཏགས་པ་ཙམ་དུ་ཟད་དོ། །
en: “Śāradvatī­putra, the ‘nine contemplations of impurity’ are merely conceptualized.

source: འདུ་ཤེས་ཀྱི་མིང་དེ་དག་ཀྱང་ནང་ན་ཡང་མེད་ཕྱི་རོལ་ན་ཡང་མེད། གཉི་གའི་བར་ན་ཡང་མི་གནས་སོ། །
en: Even the names of the contemplations [of impurity] do not exist internally, nor do they exist externally, and nor do they abide between these two.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། རྗེས་སུ་དྲན་པ་བཅུ་ཞེས་བྱ་བ་གང་དག་ཡིན་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ། ཆོས་སུ་བཏགས་པ་ཙམ་དུ་ཟད་དོ། །
en: “Śāradvatī­putra, the ‘ten recollections’ are merely conceptualized.

source: རྗེས་སུ་དྲན་པའི་མིང་དེ་དག་ཀྱང་ནང་ན་ཡང་མེད་ཕྱི་རོལ་ན་ཡང་མེད་གཉི་གའི་བར་ན་ཡང་མི་གནས་སོ། །
en: Even the names of the recollections do not exist internally, nor do they exist externally, and nor do they abide between these two.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། འདུ་ཤེས་ཀྱི་རྣམ་པ་དྲུག་ཅེས་བྱ་བ་གང་དག་ཡིན་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ། ཆོས་སུ་བཏགས་པ་ཙམ་དུ་ཟད་དོ། །
en: “Śāradvatī­putra, the ‘six aspects of perception’ are merely conceptualized.

source: འདུ་ཤེས་ཀྱི་རྣམ་པ་དྲུག་གི་མིང་དེ་དག་ཀྱང་ནང་ན་ཡང་མེད་ཕྱི་རོལ་ན་ཡང་མེད། གཉི་གའི་བར་ན་ཡང་མི་གནས་སོ། །
en: Even the names of the six aspects of perception do not exist internally, nor do they exist externally, and nor do they abide between these two.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། ཤེས་པ་བཅུ་ཞེས་བྱ་བ་གང་དག་ཡིན་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ། ཆོས་སུ་བཏགས་པ་ཙམ་དུ་ཟད་དོ། །
en: “Śāradvatī­putra, the ‘ten aspects of knowledge’ are merely conceptualized.

source: ཤེས་པའི་མིང་དེ་དག་ཀྱང་ནང་ན་ཡང་མེད་ཕྱི་རོལ་ན་ཡང་མེད། གཉི་གའི་བར་ན་ཡང་མི་གནས་སོ། །
en: Even the names of the aspects of knowledge do not exist internally, nor do they exist externally, and nor do they abide between these two.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། ཏིང་ངེ་འཛིན་གསུམ་ཞེས་བྱ་བ་གང་དག་ཡིན་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ། ཆོས་སུ་བཏགས་པ་ཙམ་དུ་ཟད་དོ། །
en: “Śāradvatī­putra, the ‘three meditative stabilities’ are merely conceptualized.

source: ཏིང་ངེ་འཛིན་གྱི་མིང་དེ་དག་ཀྱང་ནང་ན་ཡང་མེད་ཕྱི་རོལ་ན་ཡང་མེད་གཉི་གའི་བར་ན་ཡང་མི་གནས་སོ། །
en: Even the names of the meditative stabilities do not exist internally, nor do they exist externally, and nor do they abide between these two.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། དབང་པོ་གསུམ་ཞེས་བྱ་བ་གང་དག་ཡིན་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ། ཆོས་སུ་བཏགས་པ་ཙམ་དུ་ཟད་དོ། །
en: “Śāradvatī­putra, the ‘three faculties’ are merely conceptualized.

source: དབང་པོའི་མིང་དེ་དག་ཀྱང་ནང་ན་ཡང་མེད་ཕྱི་རོལ་ན་ཡང་མེད། གཉི་གའི་བར་ན་ཡང་མི་གནས་སོ། །
en: Even the names of the [three] faculties do not exist internally, nor do they exist externally, and nor do they abide between these two.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། ཟིལ་གྱིས་གནོན་པའི་སྐྱེ་མཆེད་བརྒྱད་ཅེས་བྱ་བ་གང་དག་ཡིན་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ། ཆོས་སུ་བཏགས་པ་ཙམ་དུ་ཟད་དོ། །
en: “Śāradvatī­putra, the ‘eight sense fields of mastery’ are merely conceptualized.

source: ཟིལ་གྱིས་གནོན་པའི་སྐྱེ་མཆེད་ཀྱི་མིང་དེ་དག་ཀྱང་ནང་ན་ཡང་མེད་ཕྱི་རོལ་ན་ཡང་མེད། གཉི་གའི་བར་ན་ཡང་མི་གནས་སོ། །
en: Even the names of the sense fields of mastery do not exist internally, nor do they exist externally, and nor do they abide between these two.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། ཟད་པར་གྱི་སྐྱེ་མཆེད་བཅུ་ཞེས་བྱ་བ་གང་དག་ཡིན་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ། ཆོས་སུ་བཏགས་པ་ཙམ་དུ་ཟད་དོ། །
en: “Śāradvatī­putra, the ‘ten sense fields of total consummation’ are merely conceptualized.
